# Issued Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Revision..::..Issued Property
Revision Class See Also
---
Indicates whether this Revision has been issued.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool Issued { get; set; }
```

Visual Basic
---
```text
Public Property Issued As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Issued {
	bool get ();
	void set (bool value);
}
```

# See Also
Revision Class
Autodesk.Revit.DB Namespace